In [1]:
import numpy as np
import pandas as pd

##### Handling Categorical Data

In [2]:
df = pd.DataFrame({
    'Color' : ["Red","Blue","Green","Red","Green"]
})

In [3]:
df

   Color
0    Red
1   Blue
2  Green
3    Red
4  Green

In [4]:
df.dtypes

Color    object
dtype: object

In [5]:
df['Color'] = df['Color'].astype('category')

In [6]:
df

   Color
0    Red
1   Blue
2  Green
3    Red
4  Green

In [7]:
df.dtypes

Color    category
dtype: object

In [8]:
sizes = pd.Categorical(['S','M','L','M','S','M','L','L',], categories=['S','M','L'],ordered=True)

sizes

['S', 'M', 'L', 'M', 'S', 'M', 'L', 'L']
Categories (3, object): ['S' < 'M' < 'L']

In [9]:
df_grades = pd.DataFrame({'Grade' : ['A','B','C','A','c','B']})

In [10]:
df_grades.value_counts()

Grade
A        2
B        2
C        1
c        1
Name: count, dtype: int64

In [12]:
df_grades['Grade'].value_counts()

Grade
A    2
B    2
C    1
c    1
Name: count, dtype: int64

In [13]:
df = pd.DataFrame({
    'City' : ['Delhi','Mumbai','Delhi','Mumbai','Mumbai'],
    'Sales' : [200,301,610,410,159]
})

In [14]:
df

     City  Sales
0   Delhi    200
1  Mumbai    301
2   Delhi    610
3  Mumbai    410
4  Mumbai    159

In [15]:
df.groupby(by="City").sum()

        Sales
City
Delhi     810
Mumbai    870

In [16]:
df = pd.DataFrame({
    'Size' : ['M','L','S','L'],
    'Item' : ['Shirt','Pants','Shirt','Cap']
})

In [17]:
df

  Size   Item
0    M  Shirt
1    L  Pants
2    S  Shirt
3    L    Cap

In [18]:
df['Size'] = pd.Categorical(df['Size'],categories = ['S','M','L'],ordered = True)

In [19]:
df

  Size   Item
0    M  Shirt
1    L  Pants
2    S  Shirt
3    L    Cap

In [21]:
df.sort_values(by = 'Size')

  Size   Item
2    S  Shirt
0    M  Shirt
1    L  Pants
3    L    Cap

In [23]:
df

  Size   Item
0    M  Shirt
1    L  Pants
2    S  Shirt
3    L    Cap

In [25]:
df['Size'] > 'M'

0    False
1     True
2    False
3     True
Name: Size, dtype: bool

In [26]:
df[df['Size'] > 'M']

  Size   Item
1    L  Pants
3    L    Cap

In [27]:
df['is_large'] = df['Size'] > 'M'

In [28]:
df

  Size   Item  is_large
0    M  Shirt     False
1    L  Pants      True
2    S  Shirt     False
3    L    Cap      True

In [29]:
df[df['Size'] > 'M']

  Size   Item  is_large
1    L  Pants      True
3    L    Cap      True

In [30]:
df[df['Size'] > 'S']

  Size   Item  is_large
0    M  Shirt     False
1    L  Pants      True
3    L    Cap      True

In [31]:
df[df['Size'] == 'M']

  Size   Item  is_large
0    M  Shirt     False

In [32]:
df

  Size   Item  is_large
0    M  Shirt     False
1    L  Pants      True
2    S  Shirt     False
3    L    Cap      True

In [ ]:
df['Size'].cat.rename_categories(['Small','Medium','Large'])

0    Medium
1     Large
2     Small
3     Large
Name: Size, dtype: category
Categories (3, object): ['Small' < 'Medium' < 'Large']

In [34]:
ndf = df['Size'].cat.rename_categories({'S': 'Small','M':'Medium','L':'Large'})

In [35]:
ndf

0    Medium
1     Large
2     Small
3     Large
Name: Size, dtype: category
Categories (3, object): ['Small' < 'Medium' < 'Large']

In [36]:
employees = pd.DataFrame({
    'Name' : ['Arjun','Bhism','Chitra-Gupt','Devrat','E maa Mataji'],
    'Gender' : ['Male','Male','Male','Male','Female'],
    'Age' : [25,36,15,46,52],
    'Salary' : [525200,513210,555522,884422,910321],
    'Role' : ['Eng','Man','Ana','Hr','Director']
})

employees

           Name  Gender  Age  Salary      Role
0         Arjun    Male   25  525200       Eng
1         Bhism    Male   36  513210       Man
2   Chitra-Gupt    Male   15  555522       Ana
3        Devrat    Male   46  884422        Hr
4  E maa Mataji  Female   52  910321  Director

In [37]:
pd.get_dummies(employees, columns = ['Gender'])

           Name  Age  Salary      Role  Gender_Female  Gender_Male
0         Arjun   25  525200       Eng          False         True
1         Bhism   36  513210       Man          False         True
2   Chitra-Gupt   15  555522       Ana          False         True
3        Devrat   46  884422        Hr          False         True
4  E maa Mataji   52  910321  Director           True        False